---
kind: property
id: P:Autodesk.Revit.DB.TableCellCombinedParameterData.Separator
source: html/16725cd7-bf2f-4f79-ea63-ff10cdfb61e8.htm
---
# Autodesk.Revit.DB.TableCellCombinedParameterData.Separator Property

The separator for this parameter

## Syntax (C#)
```csharp
public string Separator { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null